In [5]:
#import packeges
import pandas as pd
import numpy as np

#load data
auth=pd.read_csv('C:/Users/luisa/Documents/BIPM_2/DWH4SLR/reports/authors.csv')
auth.head()

,article_id,author_position,fullname,surname,firstname,middlename,email,departments,institutions,countries
0,2,1,"Yan, Kevin",Yan,Kevin,NaN,NaN,NaN,Dalton State College,United States
1,2,2,"Leidner, Dorothy E.",Leidner,Dorothy,E.,NaN,NaN,Baylor University and Lund University,United States
2,2,3,"Zou, Weifei",Zou,Weifei,NaN,NaN,NaN,Deakin University,Australia
3,57,1,"Wilson, F A.",Wilson,F,A.,NaN,The Information Technology Institute,University of Salford,UK
4,57,2,"Galliers, R D.",Galliers,R,D.,NaN,The Information Technology Institute,University of Salford,UK

In [2]:
auth.shape

(130667, 10)

In [9]:
#same sirname and firstname
print(auth.duplicated(subset=["surname", "firstname"]).value_counts())

#same sirname, firstname and middlename
print(auth.duplicated(subset=["surname", "firstname", "middlename"]).value_counts())

#same sirname, firstname, middlename and country
print(auth.duplicated(subset=["surname", "firstname", "middlename", "countries"]).value_counts())

#same sirname, firstname and country
print(auth.duplicated(subset=["surname", "firstname", "countries"]).value_counts())

True     79760
False    50907
dtype: int64
True     70758
False    59909
dtype: int64
False    70584
True     60083
dtype: int64
True     68902
False    61765
dtype: int64